-- phpMyAdmin SQL Dump
-- version 4.8.4
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Фев 25 2019 г., 05:52
-- Версия сервера: 10.1.37-MariaDB
-- Версия PHP: 7.3.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `bd_schedule`
--

-- --------------------------------------------------------

--
-- Структура таблицы `101`
--

CREATE TABLE `101` (
  `id` int(10) UNSIGNED NOT NULL,
  `day` varchar(20) NOT NULL,
  `1` text NOT NULL,
  `2` text NOT NULL,
  `3` text NOT NULL,
  `4` text NOT NULL,
  `5` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `101`
--

INSERT INTO `101` (`id`, `day`, `1`, `2`, `3`, `4`, `5`) VALUES
(0, 'time', '09:00-10:20', '10:30-11:50', '12:00-13:20', '14:00-15:20', '15:30-16:50'),
(1, 'Mon1', 'матан', 'теор мех', 'физ-ра', 'философия', 'нет пар'),
(2, 'Tue1', 'история', 'физ-ра', 'матан', 'философия', 'нет пар'),
(3, 'Wed1', 'нет пар', 'алгебра', 'история', 'философия', 'нет пар'),
(4, 'Thu1', 'матан', 'история', 'теор мех', 'нет пар', 'адус'),
(5, 'Fri1', 'нет пар', 'теор мех', 'матан', 'физ-ра', 'нет пар'),
(6, 'Sat1', 'нет пар', 'матан', 'физ-ра', 'философия', 'нет пар'),
(7, 'Mon2', 'адус', 'матан', 'алгебра', 'адус', 'нет пар'),
(8, 'Tue2', 'адус', 'физ-ра', 'матан', 'алгебра', 'нет пар'),
(9, 'Wed2', 'теор мех', 'матан', 'философия', 'музыка', 'адус'),
(10, 'Thu2', 'нет пар', 'адус', 'алгебра', 'матан', 'нет пар'),
(11, 'Fri2', 'адус', 'теор мех', 'матан', 'физ-ра', 'нет пар'),
(12, 'Sat2', 'философия', 'адус', 'философия', 'нет пар', 'матан');

-- --------------------------------------------------------

--
-- Структура таблицы `102`
--

CREATE TABLE `102` (
  `id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `day` varchar(20) NOT NULL,
  `1` text NOT NULL,
  `2` text NOT NULL,
  `3` text NOT NULL,
  `4` text NOT NULL,
  `5` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `102`
--

INSERT INTO `102` (`id`, `day`, `1`, `2`, `3`, `4`, `5`) VALUES
(0, 'time', '09:00-10:20', '10:30-11:50', '12:00-13:20', '14:00-15:20', '15:30-16:50'),
(1, 'Mon1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(2, 'Tue1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(3, 'Wed1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(4, 'Thu1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(5, 'Fri1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(6, 'Sat1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(7, 'Mon2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(8, 'Tue2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(9, 'Wed2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(10, 'Thu2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(11, 'Fri2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(12, 'Sat2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар');

-- --------------------------------------------------------

--
-- Структура таблицы `103`
--

CREATE TABLE `103` (
  `id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `day` varchar(20) NOT NULL,
  `1` text NOT NULL,
  `2` text NOT NULL,
  `3` text NOT NULL,
  `4` text NOT NULL,
  `5` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `103`
--

INSERT INTO `103` (`id`, `day`, `1`, `2`, `3`, `4`, `5`) VALUES
(0, 'time', '09:00-10:20', '10:30-11:50', '12:00-13:20', '14:00-15:20', '15:30-16:50'),
(1, 'Mon1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(2, 'Tue1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(3, 'Wed1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(4, 'Thu1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(5, 'Fri1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(6, 'Sat1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(7, 'Mon2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(8, 'Tue2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(9, 'Wed2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(10, 'Thu2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(11, 'Fri2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(12, 'Sat2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар');

-- --------------------------------------------------------

--
-- Структура таблицы `202`
--

CREATE TABLE `202` (
  `id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `day` varchar(20) NOT NULL,
  `1` text NOT NULL,
  `2` text NOT NULL,
  `3` text NOT NULL,
  `4` text NOT NULL,
  `5` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `202`
--

INSERT INTO `202` (`id`, `day`, `1`, `2`, `3`, `4`, `5`) VALUES
(0, 'time', '09:00-10:20', '10:30-11:50', '12:00-13:20', '14:00-15:20', '15:30-16:50'),
(1, 'Mon1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(2, 'Tue1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(3, 'Wed1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(4, 'Thu1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(5, 'Fri1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(6, 'Sat1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(7, 'Mon2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(8, 'Tue2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(9, 'Wed2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(10, 'Thu2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(11, 'Fri2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(12, 'Sat2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар');

-- --------------------------------------------------------

--
-- Структура таблицы `203`
--

CREATE TABLE `203` (
  `id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `day` varchar(20) NOT NULL,
  `1` text NOT NULL,
  `2` text NOT NULL,
  `3` text NOT NULL,
  `4` text NOT NULL,
  `5` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `203`
--

INSERT INTO `203` (`id`, `day`, `1`, `2`, `3`, `4`, `5`) VALUES
(0, 'time', '09:00-10:20', '10:30-11:50', '12:00-13:20', '14:00-15:20', '15:30-16:50'),
(1, 'Mon1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(2, 'Tue1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(3, 'Wed1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(4, 'Thu1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(5, 'Fri1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(6, 'Sat1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(7, 'Mon2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(8, 'Tue2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(9, 'Wed2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(10, 'Thu2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(11, 'Fri2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(12, 'Sat2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар');

-- --------------------------------------------------------

--
-- Структура таблицы `301`
--

CREATE TABLE `301` (
  `id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `day` varchar(20) NOT NULL,
  `1` text NOT NULL,
  `2` text NOT NULL,
  `3` text NOT NULL,
  `4` text NOT NULL,
  `5` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `301`
--

INSERT INTO `301` (`id`, `day`, `1`, `2`, `3`, `4`, `5`) VALUES
(0, 'time', '09:00-10:20', '10:30-11:50', '12:00-13:20', '14:00-15:20', '15:30-16:50'),
(1, 'Mon1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(2, 'Tue1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(3, 'Wed1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(4, 'Thu1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(5, 'Fri1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(6, 'Sat1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(7, 'Mon2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(8, 'Tue2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(9, 'Wed2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(10, 'Thu2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(11, 'Fri2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(12, 'Sat2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар');

-- --------------------------------------------------------

--
-- Структура таблицы `302`
--

CREATE TABLE `302` (
  `id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `day` varchar(20) NOT NULL,
  `1` text NOT NULL,
  `2` text NOT NULL,
  `3` text NOT NULL,
  `4` text NOT NULL,
  `5` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `302`
--

INSERT INTO `302` (`id`, `day`, `1`, `2`, `3`, `4`, `5`) VALUES
(0, 'time', '09:00-10:20', '10:30-11:50', '12:00-13:20', '14:00-15:20', '15:30-16:50'),
(1, 'Mon1', 'матан', 'теор мех', 'алгебра', 'нет пар', 'физ-ра'),
(2, 'Tue1', 'матан', 'рисование', 'теор мех', 'нет пар', 'нет пар'),
(3, 'Wed1', 'теор мех', 'рисование', 'нет пар', 'нет пар', 'рисование'),
(4, 'Thu1', 'нет пар', 'матан', 'матан', 'нет пар', 'нет пар'),
(5, 'Fri1', 'теор мех', 'рисование', 'теор мех', 'нет пар', 'нет пар'),
(6, 'Sat1', 'матан', 'рисование', 'алгебра', 'физ-ра', 'физ-ра'),
(7, 'Mon2', 'нет пар', 'рисование', 'матан', 'алгебра', 'нет пар'),
(8, 'Tue2', 'матан', 'рисование', 'алгебра', 'нет пар', 'нет пар'),
(9, 'Wed2', 'теор мех', 'матан', 'рисование', 'нет пар', 'нет пар'),
(10, 'Thu2', 'нет пар', 'матан', 'рисование', 'нет пар', 'нет пар'),
(11, 'Fri2', 'матан', 'теор мех', 'алгебра', 'нет пар', 'труд'),
(12, 'Sat2', 'матан', 'рисование', 'теор мех', 'нет пар', 'нет пар');

-- --------------------------------------------------------

--
-- Структура таблицы `401`
--

CREATE TABLE `401` (
  `id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `day` varchar(20) NOT NULL,
  `1` text NOT NULL,
  `2` text NOT NULL,
  `3` text NOT NULL,
  `4` text NOT NULL,
  `5` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `401`
--

INSERT INTO `401` (`id`, `day`, `1`, `2`, `3`, `4`, `5`) VALUES
(0, 'time', '09:00-10:20', '10:30-11:50', '12:00-13:20', '14:00-15:20', '15:30-16:50'),
(1, 'Mon1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(2, 'Tue1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(3, 'Wed1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(4, 'Thu1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(5, 'Fri1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(6, 'Sat1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(7, 'Mon2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(8, 'Tue2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(9, 'Wed2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(10, 'Thu2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(11, 'Fri2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(12, 'Sat2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар');

-- --------------------------------------------------------

--
-- Структура таблицы `402`
--

CREATE TABLE `402` (
  `id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `day` varchar(20) NOT NULL,
  `1` text NOT NULL,
  `2` text NOT NULL,
  `3` text NOT NULL,
  `4` text NOT NULL,
  `5` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `402`
--

INSERT INTO `402` (`id`, `day`, `1`, `2`, `3`, `4`, `5`) VALUES
(0, 'time', '09:00-10:20', '10:30-11:50', '12:00-13:20', '14:00-15:20', '15:30-16:50'),
(1, 'Mon1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(2, 'Tue1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(3, 'Wed1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(4, 'Thu1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(5, 'Fri1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(6, 'Sat1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(7, 'Mon2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(8, 'Tue2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(9, 'Wed2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(10, 'Thu2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(11, 'Fri2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(12, 'Sat2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар');

-- --------------------------------------------------------

--
-- Структура таблицы `403`
--

CREATE TABLE `403` (
  `id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `day` varchar(20) NOT NULL,
  `1` text NOT NULL,
  `2` text NOT NULL,
  `3` text NOT NULL,
  `4` text NOT NULL,
  `5` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `403`
--

INSERT INTO `403` (`id`, `day`, `1`, `2`, `3`, `4`, `5`) VALUES
(0, 'time', '09:00-10:20', '10:30-11:50', '12:00-13:20', '14:00-15:20', '15:30-16:50'),
(1, 'Mon1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(2, 'Tue1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(3, 'Wed1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(4, 'Thu1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(5, 'Fri1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(6, 'Sat1', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(7, 'Mon2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(8, 'Tue2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(9, 'Wed2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(10, 'Thu2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(11, 'Fri2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар'),
(12, 'Sat2', 'нет пар', 'нет пар', 'нет пар', 'нет пар', 'нет пар');

-- --------------------------------------------------------

--
-- Структура таблицы `course`
--

CREATE TABLE `course` (
  `id` int(11) NOT NULL,
  `course` int(11) NOT NULL,
  `groups` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `course`
--

INSERT INTO `course` (`id`, `course`, `groups`) VALUES
(1, 1, 101),
(2, 1, 102),
(3, 1, 103),
(4, 2, 202),
(5, 2, 203),
(6, 3, 301),
(7, 3, 302),
(8, 4, 401),
(9, 4, 402),
(10, 4, 403);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `101`
--
ALTER TABLE `101`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `102`
--
ALTER TABLE `102`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `103`
--
ALTER TABLE `103`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `202`
--
ALTER TABLE `202`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `203`
--
ALTER TABLE `203`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `301`
--
ALTER TABLE `301`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `302`
--
ALTER TABLE `302`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `401`
--
ALTER TABLE `401`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `402`
--
ALTER TABLE `402`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `403`
--
ALTER TABLE `403`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `course`
--
ALTER TABLE `course`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `101`
--
ALTER TABLE `101`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT для таблицы `course`
--
ALTER TABLE `course`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
